---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManager.GetEnumerator
source: html/c2aaccac-a7d0-51f3-8042-c51ca87d686f.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<MacroModule> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.